app/Http/Controllers/CartController.php

    public function addToCart(Request $request){

        if(Auth::check()){

            $products_id = $request->input('products_id');
            $qty = $request->input('products_qty');

            if(Cart::where('users_id', Auth::id())->where('products_id', $products_id)->exists()){
                return response()->json(['status' =>"Produk Sudah Ada Di Keranjang"]);
            } else {

                $insert = Cart::create([
                    'users_id' => Auth::user()->id,
                    'products_id' => $products_id,
                    'qty' => $qty,
                ]);
---
select exists(select * from `carts` where `users_id` = 1 and `products_id` = '1') as `exists`
insert into `carts` (`users_id`, `products_id`, `qty`, `updated_at`, `created_at`) values (1, '1', '1', '2022-03-28 12:00:55', '2022-03-28 12:00:55')

    public function update(Request $request){

        if(!$request->ajax()){
            return redirect('/');
        }

        $products_id = $request->input('products_id');
        $qty = $request->input('qty');

        $update = Cart::where('users_id', Auth::user()->id)->where('products_id', $products_id)->first();
        $update->qty = $qty;
        $update->update();
---
select * from `carts` where `users_id` = 1 and `products_id` = '1' limit 1
update `carts` set `qty` = '2', `carts`.`updated_at` = '2022-03-28 11:50:45' where `id` = 3