app/Http/Controllers/CheckoutController.php

    public function index(){

        // agar product yang stoknya sudah habis tidak bisa masuk ke checkout page
        $old_carts = Cart::where('users_id', Auth::id())->get();
        foreach($old_carts as $cart){

            if(!Product::where('id', $cart->products_id)->where('stok', '>=', $cart->qty)->exists()){

                $delete = Cart::where('users_id', Auth::id())->where('products_id', $cart->products_id);
                $delete->delete();
            }
        }

        $carts = Cart::where('users_id', Auth::id())->get();
---
select * from `carts` where `users_id` = 1
select exists(select * from `products` where `id` = '2' and `stok` >= 1) as `exists`

    public function order(Request $request){

        $validatedData = $request->validate([
            'fname' => 'required|min:3',
            'lname' => 'required|min:3',
            'email' => 'required|email:dns',
            'no_hp' => 'required|min:3',
            'alamat' => 'required|min:3',
            'kota' => 'required|min:3',
            'provinsi' => 'required|min:3',
            'pincode' => 'required|min:3',
        ],[
            'fname.required' => 'The first name field is required.',
            'lname.required' => 'The last name field is required.',
            'no_hp.required' => 'The nomor hp field is required.',
        ]);

        // untuk mengkalkulasi total harga
        $total = 0;
        $cart_total = Cart::where('users_id', Auth::id())->get();
        foreach($cart_total as $cart){
            $total += $cart->products->harga * $cart->qty;
        }

        // ambil total harga, id user login yang order item, dan beri nomor resi
        $validatedData['total_harga'] = $total;
        $validatedData['users_id'] = Auth::user()->id;
        $validatedData['no_resi'] = 'KLNTG' . rand(1111,9999);

        $order = Order::create($validatedData);

        $carts = Cart::where('users_id', Auth::id())->get();

        foreach($carts as $cart){

            OrderItem::create([
                'orders_id' => $order->id,
                'products_id' => $cart->products_id,
                'qty' => $cart->qty,
                'harga' => $cart->products->harga,
            ]);

            // setiap order item, maka stok product akan berkurang
            $product = Product::where('id', $cart->products_id)->first();
            $product->stok = $product->stok - $cart->qty;
            $product->update();
        }

        // jika item cart masuk ke order, maka cart akan dihapus
        $carts = Cart::where('users_id', Auth::id())->get();
        Cart::destroy($carts);
---
select * from `carts` where `users_id` = 1
insert into `orders` (`fname`, `lname`, `email`, `no_hp`, `alamat`, `kota`, `provinsi`, `kode_pos`, `total_harga`, `users_id`, `no_resi`, `updated_at`, `created_at`) values ('Azka', 'Hanifassalam Rabbani', 'user@gmail.com', '1231231', 'asdad', 'bandung', 'jawa barat', '12121', 12000000, 1, 'KLNTG3290', '2022-03-28 12:01:03', '2022-03-28 12:01:03')
insert into `order_items` (`orders_id`, `products_id`, `qty`, `harga`, `updated_at`, `created_at`) values (1, '1', 1, 12000000, '2022-03-28 12:01:03', '2022-03-28 12:01:03')
select * from `products` where `id` = '1' limit 1
update `products` set `stok` = 4, `products`.`updated_at` = '2022-03-28 12:01:03' where `id` = 1
delete from `carts` where `id` = 1