app/Http/Controllers/DashboardController.php

select * from `categories`
---
    public function create()
    {
        return view('dashboard.create', [
            'title' => 'Tambah Product',
            'categories' => Category::all()
        ]);

insert into `products` (`product_name`, `stok`, `harga`, `desc`, `category_id`, `image`, `users_id`, `updated_at`, `created_at`) values ('Promo Sembako Murah - Beras. Minyak, Terigu DLL - Paket Komplit', '10', '30000', '<div>sembako murah meriah</div>', '5', 'product-images/q1dqhZsm7mqWv5WjbciEiw6vE6d1NZhoCboJF6J8.jpg,product-images/CVgyW1QCx2Wfd68TfMGcVVR1CyP4NrpmCDBAyMBO.jpg,product-images/jdsSRlODScgIRDTO9YxefmisAvdfHK8AWsQAx1Oy.jpg', 2, '2022-03-23 14:45:26', '2022-03-23 14:45:26')
---
    public function store(Request $request)
    {

        $validatedData = $request->validate([
            'product_name' => 'required|min:3',
            'qty' => 'required|digits_between:1,9999999',
            'desc' => 'required',
            'category_id' => 'required',
            'image' => 'image|file|max:1024'
        ]);

        if($request->file('image')){
            $validatedData['image'] = $request->file('image')->store('post-images');
        }

        $validatedData['users_id'] = auth()->user()->id;

        Product::create($validatedData);