app/Http/Controllers/DashboardController.php

    public function index()
    {
        return view('dashboard.dashboard',[
            "title" => "Dashboard",
            'category_s' => Product::select(['category_id'])->where('users_id', auth()->user()->id)->distinct()->get(),
            "allpost" => Product::all()->where('users_id', auth()->user()->id)->count(),
            "totalqty" => Product::all()->where('users_id', auth()->user()->id)->sum('stok'),
---
select distinct `category_id` from `products` where `users_id` = 1
select * from `users` where `users`.`id` in (1)

    public function orders(){

        return view('dashboard.order', [
            "title" => "Order",
            "orders" => Order::where('status', "pending")->get()
---
select * from `orders` where `status` = 'pending' or `status` = 'proses' or `status` = 'kirim'

    public function orderHistory(){

        return view('dashboard.history', [
            "title" => "Order",
            "orders" => Order::where('status', "beres")->orWhere('status', "tolak")->get()
---
select * from `orders` where `status` = 'beres' or `status` = 'tolak'

    public function create()
    {
        return view('dashboard.create', [
            'title' => 'Tambah Product',
            'categories' => Category::all()
        ]);
---
select * from `categories`

    public function store(Request $request)
    {

        $validatedData = $request->validate([
            'product_name' => 'required|min:3',
            'stok' => 'required|digits_between:1,9999999',
            'harga' => 'required|digits_between:1,9999999',
            'desc' => 'required',
            'category_id' => 'required',
            'image' => 'required',
            'image.*' => 'mimes:jpeg,jpg,png,gif,csv,txt,pdf,JPG|max:2048'
        ]);

        if($request->file('image')){
            $length = sizeof($request->file('image'));
            for($i=0; $i < $length; $i++){
                $request->file('image')[$i]->store('product-images');
                $image[$i] = $request->file('image')[$i]->store('product-images');
            }
            $arrImg=implode(',', $image);
            $validatedData['image'] = $arrImg;
        }

        $validatedData['users_id'] = auth()->user()->id;

        Product::create($validatedData);
---
insert into `products` (`product_name`, `stok`, `harga`, `desc`, `category_id`, `image`, `users_id`, `updated_at`, `created_at`) values ('Alat tulis satu set', '12', '20000', '<div>asd</div>', '6', 'product-images/CDGli6WPHZM69NqX3wZdYSzAGvM0QUiVgeodGLFf.jpg', 1, '2022-03-28 10:04:35', '2022-03-28 10:04:35')