app/Http/Controllers/HomeController.php

    public function index(){
        if(Auth::check()){
            if(auth()->user()->hasVerifiedEmail()){
                return view('home', [
                    'title' => 'Home',
                    'products' => Product::latest()->take(30)->get(),
                    'productsBest' => Product::latest()->take(12)->get(),
                    'carts' => Cart::where('users_id', Auth::id())->get(),
                ]);
            }else{
                return redirect('/verify-email');
            }
        }else{
            return view('home', [
                'title' => 'Home',
                'products' => Product::latest()->take(30)->get(),
                'productsBest' => Product::latest()->take(12)->get(),
                'carts' => Cart::where('users_id', Auth::id())->get(),
---
select * from `carts` where `users_id` is null
select * from `products` order by `created_at` desc limit 30
select * from `products` order by `created_at` desc limit 12
select * from `carts` where `users_id` = 1

    public function detail(Request $request){

        $namaP = $request->produk;
        $toko = $request->toko;

        $product = Product::whereHas('toko', function($q) use ($toko){
            $q->where('nama_toko', '=' , $toko);
        })->where('product_name', $namaP)->first();

        $ratings = Rating::where('products_id', $product->id)->get();
        $total_ratings = Rating::where('products_id', $product->id)->sum('stars_rated');
        $user_rating = Rating::where('products_id', $product->id)->where('users_id', Auth::id())->first();
        $reviews = Rating::where('products_id', $product->id)->get();
        $review = Rating::where('products_id', $product->id)->where('users_id', Auth::id())->first();

        if($ratings->count() > 0){
            $rating_value = $total_ratings / $ratings->count();
        } else {
            $rating_value = 0;
        }

        return view('detail', [
            'title' => $product->product_name,
            'carts' => Cart::where('users_id', Auth::id())->get(),
            "totalqty" => Product::where('id', $product->id)->sum('stok'),
            'product' => $product,
            "ratings" => $ratings,
            "rating_value" => $rating_value,
            "user_rating" => $user_rating,
            "reviews" => $reviews,
            "review" => $review,
        ]);
---
select * from `products` where exists (select * from `toko` where `products`.`toko_id` = `toko`.`id` and `nama_toko` = 'azka shop') and `product_name` = 'Kopi' limit 1
select * from `ratings` where `products_id` = 1
select sum(`stars_rated`) as aggregate from `ratings` where `products_id` = 1
select * from `ratings` where `products_id` = 1 and `users_id` = 1 limit 1
select * from `carts` where `users_id` = 1
select sum(`stok`) as aggregate from `products` where `id` = 1