app/Http/Controllers/HomeController.php

select * from `users` where `users`.`id` in (1)
---
    public function detail(Product $product, User $user){
        return view('detail', [
            'title' => $product->product_name,
            'product' => $product,
            "totalqty" => Product::where('id', $product->id)->sum('stok'),
            'user' => $user
        ]);