app/Http/Controllers/OrderController.php

select * from `orders` where `users_id` = 1
select * from `carts` where `users_id` = 1
select * from `ratings` where `products_id` is null and `users_id` = 1 limit 1
---
    public function index(Order $order, OrderItem $orderItems){

        $orders = Order::where('users_id', auth()->user()->id)->get();

        $carts = Cart::where('users_id', Auth::id())->get();
        $user_rating = Rating::where('products_id', $orderItems->products_id)->where('users_id', Auth::id())->first();
        $review = Rating::where('products_id', $orderItems->products_id)->where('users_id', Auth::id())->first();

select * from `orders` where `id` = '1' and `users_id` = 1 limit 1
select * from `carts` where `users_id` = 1
---
    public function show($id){

        $orders = Order::where('id', $id)->where('users_id', Auth::id())->first();
        $carts = Cart::where('users_id', Auth::id())->get();