app/Http/Controllers/OrderController.php

    public function index(Order $order){

        /* $orders = OrderItem::whereHas('order', function($p){
            $p->where('users_id', '=', auth()->user()->id);
        })->get(); */
---
select * from `order_items` limit 1