app/Http/Controllers/RatingController.php

select * from `products` where `id` = '2' limit 1
select * from `orders` inner join `order_items` on `orders`.`id` = `order_items`.`orders_id` where `users_id` = 1 and `status` = 'beres' and `order_items`.`products_id` = '2' limit 1
select * from `orders` inner join `order_items` on `orders`.`id` = `order_items`.`orders_id` where `orders`.`users_id` = 1 and `order_items`.`products_id` = '2'
select * from `ratings` where `users_id` = 1 and `products_id` = '2' limit 1
select * from `orders` inner join `order_items` on `orders`.`id` = `order_items`.`orders_id` where `orders`.`users_id` = 1 and `order_items`.`products_id` = '1'
update `ratings` set `stars_rated` = '2', `user_review` = 'test', `ratings`.`updated_at` = '2022-03-28 11:30:39' where `id` = 1
insert into `ratings` (`users_id`, `products_id`, `stars_rated`, `user_review`, `updated_at`, `created_at`) values (1, '2', '5', 'asdasdas', '2022-03-28 10:05:26', '2022-03-28 10:05:26')
---
    public function add(Request $request){

        $stars = $request->input('product_rating');
        $products_id = $request->input('products_id');

        $product = Product::where('id', $products_id)->first();
        $order = Order::where('users_id', Auth::id())->where('status', 'beres')
                    ->join('order_items', 'orders.id', 'order_items.orders_id')
                    ->where('order_items.products_id', $products_id)->first();

        if($product && $order){

            $verified = Order::where('orders.users_id', Auth::id())
                                ->join('order_items', 'orders.id', 'order_items.orders_id')
                                ->where('order_items.products_id', $products_id)->get();

                if($verified){

                    $rating = Rating::where('users_id', Auth::id())->where('products_id', $products_id)->first();

                    if($rating){
                        $rating->stars_rated = $stars;
                        $rating->update();

                    } else {
                        Rating::create([
                            'users_id' => Auth::id(),
                            'products_id' => $products_id,
                            'stars_rated' => $stars
                        ]);