app/Http/Controllers/RegisterController.php

    public function buat(Request $request){
        $validatedData = $request->validate([
            'nama_toko' => 'required|min:5;',
            'alamat' => 'required',
            'kota' => 'required',
            'image' => 'required',
            'image.*' => 'mimes:jpeg,jpg,png,JPG|max:2048'
        ]);

        dd($validatedData);

        /* $validatedData['password'] = bcrypt($validatedData['password']);
        $user = User::where('email', $validatedData['email'])->first();
        if($user->exists()){
---
select * from `users` where `email` = 'kurabersayap002@gmail.com' limit 1
select exists(select * from `users`) as `exists`