app/Http/Controllers/RegisterController.php

insert into `users` (`name`, `email`, `role`, `handphone_number`, `password`, `updated_at`, `created_at`) values ('Muhammad Naufal Muttaqin', 'kurabersayap002@gmail.com', 'user', '087828944211', '$2y$10$itLN.DSrPaheyGS.Y//xyuN/Quuw1chlV/Xf4rp929nhelg0hEET.', '2022-03-23 13:40:54', '2022-03-23 13:40:54')
---
    public function store(Request $request){
        $validatedData = $request->validate([
            "name" => "required|min:3|max:255",
            "email" => "required|email:dns|unique:users,email",
            "role" => "required",
            'handphone_number' => ['required', 'numeric', 'digits:12', 'regex:/^0/'],
            "password" => "required|min:8|max:255",
            "cpassword" => "required|same:password"
        ],[
            'cpassword.same' => 'The Confirmation Password Must Match'
        ]);

        $validatedData['password'] = bcrypt($validatedData['password']);

        $user = User::create($validatedData);

select * from `users` where `id` = 2 limit 1
update `users` set `role` = 'seller', `users`.`updated_at` = '2022-03-23 14:36:21' where `id` = 2
insert into `toko` (`users_id`, `nama_toko`, `kota`, `alamat`, `image`, `updated_at`, `created_at`) values (2, 'richshop', 'Bandung', 'Jl.Maleber utara No.3 RT003 RW008', 'photo-profile-toko/I1zopZ8cHk81OKON6ES6uPcOxeXwxGA160F6bULD.jpg', '2022-03-23 13:49:55', '2022-03-23 13:49:55')
---
    public function buat(Request $request){
        $validatedData = $request->validate([
            'nama_toko' => 'required|min:5;',
            'alamat' => 'required',
            'kota' => 'required',
            'image' => 'required',
            'image.*' => 'mimes:jpeg,jpg,png,JPG|max:2048'
        ]);
        $image = $validatedData['image']->store('photo-profile-toko');

        $user = User::where('id', Auth::id())->first();
        $user->role = 'seller';
        $user->update();

        Toko::create([
            'users_id' => Auth::id(),
            'nama_toko' => $validatedData['nama_toko'],
            'kota' => $validatedData['kota'],
            'alamat' => $validatedData['alamat'],
            'image' => $image,
        ]);